import 'package:book_store/Data/Databook.dart';
import 'package:book_store/component/Icon/Icon_close.dart';
import 'package:book_store/component/Icon/Icon_search.dart';
import 'package:book_store/component/tabbar/TabbarBestsell.dart';
import 'package:book_store/component/tabbar/TabbarNewbook.dart';
import 'package:book_store/component/tabbar/TabbarReadfree.dart';
import 'package:book_store/component/tabbar/TabbarRecommend.dart';
import 'package:book_store/component/tabbar/Text_Appbar.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'Bookdetail.dart';

class Bestsell extends StatefulWidget {
  static String name = 'Bestsell';
  const Bestsell({Key? key}) : super(key: key);

  @override
  _DownloadState createState() => _DownloadState();
}

class _DownloadState extends State<Bestsell> {
  static List<String> booksname = [
    ' ตอน ทริปสุุดมัน ปั่นยกล้อ',
    'ตอน Coding เกมทะลุจอ',
    'ตอน โค้ชตึ๋งหนืดตืดระเบิด',
    'มันไม่ง่ายขึ้นหรอก แต่เธอจะเก่งขึ้น',
    'ความน่าจะแมว (ฉบับสมบูรณ์)',
    'ชายหนุ่มผู้ไม่ทำอะไรเลย (บันทึกไร้สาระของชีวิต)',
    'ถ้าเป็นเธอจะต้องผ่านมันไปได้แน่นอน',
    'ตอน ยุทธการหนีความจน',
    'ตอน กู้วิกฤต',
    'เอาชีวิตรอดด้วยเงิน30บาท',
    'ตอน ยาจกตระกูลตึ๋ง',
    'ตอน กระชากหน้ากากตึ๋งหนืด',
  ];

  static List<String> Author = [
    "Yang, Tae-Soo",
    "Story box",
    "Yim Chang-ho",
    "คิมซูมิน (Kim Su Min)",
    "องอาจ ชัยชาญชีพ",
    "องอาจ ชัยชาญชีพ",
    "คิมจีฮุน (Ji Hun Kim)",
    "Irumo",
    "Huh Yoon-Jung",
    "Lee Bong Gi",
    "Storybox์",
    "ละอองหญ้า",
  ];

  static List<String> Category = [
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
    "พัฒนาตนเอง",
    "พัฒนาตนเอง",
    "พัฒนาตนเอง",
    "พัฒนาตนเอง",
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
    " การ์ตูนความรู้ เสริมความรู้",
  ];

  static List<int> Pagenum = [192, 185, 163, 70, 384, 168, 463, 224, 192, 185, 163, 192];

  static List<int> price = [139, 199, 159, 242, 238, 127, 335, 99, 129, 159, 159, 189];

  static List<String> Descriptions = [
    "กริ๊ง กริ๊ง ขอทางหน่อย แก๊งจักรยานตึ๋งหนืดสุดซิ่งมาแล้ว! ถ้ามีใครมาชวนเที่ยวทั่วประเทศโดยไม่ใช้เงินสักบาท อย่าเพิ่งคิดว่าจะเป็นไปไม่ได้ คว้าจักรยานแล้วปั่นตามครอบครัวตึ๋งหนืดมาเลย ครอบครัวตึ๋งหนืดวางแผนจะไปเที่ยวทั่วประเทศกัน แต่โรส ราชินีตึ๋งหนืด ไม่ยอมให้ใช้เงินอย่างสิ้นเปลืองแน่ๆ ทริปปั่นจักรยานโดยไม่ใช้เงินสักบาทจึงเริ่มต้นขึ้น แต่โทรุ จอมป่วนของเราจะไหวหรือเปล่านะ ในเมื่อจอมเขมือบแบบเขาไม่เคยรู้วิธีขี่จักรยานที่ถูกต้องเลย",
    "โทรุจอมเขมือบที่วันๆ คิดแต่เรื่องกิน ถูกเลือกเป็นตัวแทนแข่งขันโค้ดดิง หรือการเขียนโปรแกรมสำหรับเด็กร่วมกับฮารุและจอห์น ทั้งสามต้องฝ่าภารกิจสนุกๆ มากมายในสวนสนุกแห่งโลกอนาคตที่ทุกอย่างทำงานด้วยคอมพิวเตอร์ รวมไปถึงการสร้างเกมสุดมันที่โดนใจเด็กๆ",
    "โค้ชตึ๋งหนืด กูรูด้านการใช้เงินมาแล้ว! ใครมีปัญหาเรื่องการใช้เงินบ้าง ทั้งเก็บเงินไม่อยู่ ไม่รู้ว่าเงินตัวเองหายไปไหน พอได้เงินค่าขนมมาก็ซื้อของกินของเล่นจนหมด ไม่เหลือเงินออมเลยสักบาท ถ้าเป็นแบบนี้ในอนาคตต้องแย่แน่ๆ แต่อย่าเพิ่งกังวลไป เพราะโทรุและครอบครัวตึ๋งหนืดจะมาสวมบทเป็นโค้ชตึ๋งหนืดสอนเทคนิคการประหยัดง่ายๆ ให้เอง ตั้งแต่การเขียนบัญชีรายรับ-รายจ่าย ที่จะช่วยให้เก็บเงินได้แน่นอน การตรวจเช็กใบเสร็จรับเงินเพื่อค้นหาเงินที่หายไป รวมไปถึงเทคนิคประหยัดค่าใช้จ่ายในบ้านเพื่อช่วยคุณพ่อคุณแม่ เช่น ทำน้ำยาล้างจานใช้เอง เทคนิคประหยัดค่าไฟ การดูแลสุขภาพในฤดูหนาว เคล็ดลับช่วยให้นอนหลับสบาย และอีกมากมาย ครอบครัวตึ๋งหนืด ตอน โค้ชตึ๋งหนืดตืดระเบิด จะพาทุกคนไปพบเคล็ดลับการประหยัดต่างๆ ที่ทำได้เอง และแบ่งปันแก่ผู้อื่นได้ ลองทำดูสิ แล้วเด็กๆ เองก็จะเป็นโค้ชตึ๋งหนืดได้เช่นกัน",
    "ถึงจะยากลำบากก็ยังเป็นชีวิตของเรา ถึงจะเศร้าก็ยังเป็นชีวิตของเรา ต่อให้สนุกก็ยังเป็นชีวิตของเรา ต่อให้มีความสุขก็ยังเป็นชีวิตของเรา ไม่ว่าจะทำอะไรทั้งหมดนี้ล้วนเป็นชีวิตของเรา ดังนั้นหแม้จะเกลียดชัง ก็จงอย่าโกรธแค้น จงใช้ชีวิตที่มีเพียงครั้งเดียวนี้ให้เท่ที่สุด",
    "บันทึกฉบับสมบูรณ์อันเป็นมหากาพย์ของแมวมหากาฬต้นตำนานแห่งแห่งเทพเจ้าแมวอันลือเลื่อง 'แพนด้า'กับ'แป๊วแว้ว' บันทึกความหนาเกือบสี่ร้อยหน้าที่จะขับเคลื่อนความรู้สึกอันหลากหลาย ตั้งแต่ตลกขบขันบันเทิงใจไปจนถึงการได้เรียนรู้ปรัชญาแห่งชีวิตอันเข้มข้นจากแมวสู่คน  'ความน่าจะแมว(ฉบับสมบูรณ์)' คือบันทึกคนเลี้ยงแมวที่จะทำให้ผู้อ่านได้หัวเราะร่าน้ำตาริน สร้างความซาบซึ้งประทับใจด้วยความสนุกแบบครบรส ครบทุกอารมณ์ เหมาะสมกับผู้อ่านทุกคน ทุกเพศทุกวัย ไม่ว่าจะผู้เลี้ยงแมวมือใหม่ ทาสแมวมืออาชีพ ตลอดจนคนที่ไม่เคยนึกชอบแมวเลยก็ตาม",
    "ชายหนุ่มผู้ไม่ทำอะไรเลย ความเรียงบอกเล่ามุมมองที่น่าสนใจบนความเรียบง่ายของชีวิต เต็มไปด้วยเรื่องราวหลากหลายอารมณ์ที่ถูกนำเสนอออกมาในแบบฉบับเฉพาะตัวขององอาจ ชัยชาญชีพ นักเขียนเจ้าของผลงานหลากหลายรูปแบบ ซึ่งนอกจากในหนังสือจะเต็มไปด้วยเรื่องราวที่ชวนให้ผู้อ่านอมยิ้มไปกับเรื่องต่าง ๆ แล้ว ยังมีบางแง่มุมที่ชวนให้เราได้ย้อนกลับมามองตัวเองและคนรอบข้าง นับเป็นหนังสืออีกเล่มที่สนพ.เป็ดเต่าควายภูมิใจเสนอ และอยากพาผู้อ่านไปรู้จักกับ ชายหนุ่มผู้ไม่ทำอะไรเลย ดูสักครั้ง",
    "เป็นหนังสือที่ผู้เขียนเล่าเรื่องโดยนำประสบการณ์ตัวเองมาถ่ายทอดส่วนหนึ่งก่อนตั้งคำถามถึงปัญหาและความกังวลใจที่ผู้อ่านกำลังเผชิญหน้าอยู่ ตอนเนื้อในหนึ่งบทจะสลับกันมีทั้งเรื่องเล่าของผู้เขียน เรื่องที่ปลอบโยนผู้อ่านและถ้อยคำเป็นประโยคๆ พร้อมภาพประกอบสวยงาม ถ้ามีใครสักคนที่กอดเราไว้พร้อมกับถามว่า เหนื่อยมากใช่ไหม เราน่าจะสามารถอดทนได้มากกว่านี้",
    "อยากรู้ไหมว่าจะประหยัดเงินค่าขนมได้อย่างไร ทำอย่างไรจึงจะทำให้เงินที่เก็บไว้มีเพิ่มมากขึ้น จะใช้ของฟรีได้ที่ไหนบ้าง ของที่เหลือใช้แล้วจะเอาไปทำอย่างอื่นได้ไหม ทำไมต้องจดบันทึกรายรับรายจ่าย ลองมาใช้ชีวิตกับครอบครัวตึ๋งหนืดดูสิ แล้วจะรู้คำตอบที่น่าทึ่งเรื่องวุ่นวายแสนอลหม่านของครอบครัวตึ๋งหนืดเริ่มต้นขึ้นเมื่อโกโร่หัวหน้าครอบครัวถูกลดเงินเดือน จนสมาชิกทุกคนต้องย้ายไปอยู่ในอพาร์ตเมนต์รูหนู แต่ครอบครัวตึ๋งหนืดซะอย่าง ไม่มีวันยอมแพ้ต่อโชคชะตาอันแสนรันทด ทุกคนจึงร่วมใจกันทำทุกวิถีทางเพื่อจะได้ย้ายไปอยู่ในบ้านสองห้องนอน จนทำให้เกิด ยุทธการหนีความจน ที่เด็กๆ เห็นแล้วจะต้องทึ่งกับความประหยัดแบบสุดๆ",
    "ครอบครัวตึ๋งหนืดกำลังประสบวิกฤตอีกครั้ง เมื่อคุณพ่อถูกไล่ออกจากบริษัทแล้วโทรุกับฮารุก็ต้องโดนงดค่าขนม! เด็กๆ ต้องช่วยกันทำงานพิเศษเพื่อช่วยกู้วิกฤตในครั้งนี้ ซึ่งงานแต่ละอย่างนั้นล้วนไม่ธรรมดา เช่น เป็นแขกในงานแต่งงาน เก็บขยะในหมู่บ้าน รับจ้างร้องเพลงคาราโอเกะ อ่านหนังสือนิทานให้เด็กฟัง ชิมและประเมินรสชาติขนม ฯลฯ ",
    "ครอบครัวตึ๋งหนืดกลับมาครั้งนี้จะมาสอนเคล็ดลับให้เราใช้เงินอย่างคุ้มค่า ใครว่าเงิน 30 บาทไม่มีค่าล่ะ! แชมป์ครอบครัวตึ๋งหนืดอย่างพวกเขาสามารถใช้มันทำอะไรได้ตั้งหลายอย่าง เช่น ใช้เงิน 30 บาทจัดงานขึ้นบ้านใหม่และงานวันเกิดพร้อมกัน ใช้เงิน 30 บาทไปเที่ยววันหยุด ใช้เงิน 30 บาทไปเดต ใช้เงิน 30 บาทกินข้าวเย็น มาเรียนรู้กลยุทธ์การประหยัดจากเงิน 30 บาทไปกับครอบครัวตึ๋งหนืดกันเถอะ",
    "ครอบครัวตึ๋งหนืดที่สุดแสนจะประหยัดมีปัญหาใหญ่ที่แก้ไม่ตกเสียที นั่นคือโทรุที่เป็นตัวเขมือบประจำบ้าน แม้จะเป็นฝาแฝดกับฮารุ แต่ระดับความประหยัดกลับต่างกันราวฟ้ากับเหว ถ้าปล่อยให้เป็นแบบนี้ต่อไป ครอบครัวตึ๋งหนืดต้องกลายเป็นยาจกแน่ๆ แต่โรส ตึ๋งหนืดตัวแม่ไม่มีทางยอมแพ้ งานนี้เธอต้องเปลี่ยนนิสัยโทรุให้ได้ ว่าแล้วครอบครัวตึ๋งหนืดก็ต้องงัดเคล็ดลับการประหยัดออกมา เพื่อเปลี่ยนจอมเขมือบที่เก็บเงินไม่อยู่ให้กลายเป็นเศรษฐี เช่น วิธีใช้เวลาให้คุ้มค่าแบบเศรษฐีเวลา เทคนิคการคุ้ยตู้เย็นแบบตึ๋งหนืด การบริหารดวงตาช่วยให้สายตาดี เคล็ดลับแก้ปัญหาเด็กเลือกกินอาหาร การจัดการอาหารหมดอายุแบบไม่เสียของ แต่ละไอเดีย รับประกันความตืดความฮาแน่นอน ครอบครัวตึ๋งหนืด ตอน ยาจกตระกูลตึ๋ง จะพาทุกคนไปพบเคล็ดลับการประหยัดง่ายๆ ที่ทำได้เองและแบ่งปันแก่ผู้อื่นได้ ลองทำดูสิ แล้วเด็กๆ เองก็จะกลายเป้นเศรษฐีตึ๋งหนืดที่พ่อแม่ภูมิใจได้เช่นกัน",
    "หน้ากากไหนๆ ที่ว่าแน่ ก็ต้องหลีกทางให้หน้ากากตึ๋งหนืด การประหยัดคือการลงมือปฏิบัติ ถ้าตั้งใจประหยัด ทุกสิ่งก็เป็นไปได้ นี่คือสโลแกนของหน้ากากตึ๋งหนืด ฮีโร่แห่งการประหยัดตัวจริง แม้ไม่มีใครรู้ว่าตัวจริงของเขาคือใคร แต่หน้ากากตึ๋งหนืดพร้อมจะช่วยเหลือทุกคนที่มีปัญหา",
  ];

  static List url = [
    "https://fv2-2.failiem.lv/thumb_show.php?i=5jzcykf6x&download_checksum=d7f6772ad5ac303635c3fefa5683d405bb0e6766&download_timestamp=1632562782",
    "https://fv2-4.failiem.lv/thumb_show.php?i=gnkcsd7dq&download_checksum=13bff1738bc67725b5dfa05b10e108372482b1d1&download_timestamp=1632565684",
    "https://fv2-4.failiem.lv/thumb_show.php?i=qdj5qev37&download_checksum=71dcb443c801148888e5b3a7b88ee45da97e9f7c&download_timestamp=1632565742",
    "https://fv2-1.failiem.lv/thumb_show.php?i=s6wgzmr2j&download_checksum=250cd01db9c74794e69e23ac5715f17f939ee589&download_timestamp=1632579365",
    "https://fv2-3.failiem.lv/thumb_show.php?i=wushfvtfb&download_checksum=68d2a4c1f1414fe66472e12ed5b0030806e8e543&download_timestamp=1632579415",
    "https://fv2-2.failiem.lv/thumb_show.php?i=2mq8jmvbv&download_checksum=59c9f88fad400ae2fbd05f03f85c3a78a656c7ec&download_timestamp=1632579441",
    "https://fv2-4.failiem.lv/thumb_show.php?i=xpnaspxpb&download_checksum=17df266ea4f68811c9807e2911002469c19d4a5d&download_timestamp=1632579275",
    "https://fv9-2.failiem.lv/thumb_show.php?i=3s28kggcv&download_checksum=9f0856a561ac962c746e78895b7bbde9b6e18768&download_timestamp=1632557587",
    "https://fv9-3.failiem.lv/thumb_show.php?i=6k88vefwt&download_checksum=cf75e113e610653cbe99d1d3deaa7774866b5400&download_timestamp=1632557560",
    "https://fv9-3.failiem.lv/thumb_show.php?i=8qagm7ej7&download_checksum=a53e6fa520a7fecfe41ea8390d7a7b70139f7979&download_timestamp=1632557140",
    "https://fv9-1.failiem.lv/thumb_show.php?i=zd34kdh3x&download_checksum=59d5644b875f33022995bc033554357b2edf2c80&download_timestamp=1632558294",
    "https://fv2-1.failiem.lv/thumb_show.php?i=djrnj95ux&download_checksum=11ba2a814ae88b88bb394bb2c2f8d4a5ed1327f8&download_timestamp=1632562644",
  ];

  final List<BookdataModel> bookdata = List.generate(
      booksname.length,
      (index) => BookdataModel(
            '${booksname[index]}',
            '${url[index]}',
            '${price[index]}',
            '${Descriptions[index]}',
            '${Author[index]}',
            '${Category[index]}',
            '${Pagenum[index]}',
          ));
  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      initialIndex: 1,
      length: 4,
      child: Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          backgroundColor: Colors.indigo,
          title: Text_Appbar(),
          leading: Icon(Icons.menu),
          actions: <Widget>[
            Icon_search(),
            Icon_close(),
          ],
          bottom: TabBar(
            tabs: <Widget>[
              TabbarRecommend(),
              TabbarBestsell(),
              TabbarNewbook(),
              TabbarReadfree(),
            ],
          ),
        ),
        body: ListView.builder(
          itemCount: bookdata.length,
          itemBuilder: (context, index) {
            return Card(
              child: ListTile(
                tileColor: Colors.indigo[300],
                title: Text(
                  bookdata[index].name,
                  style: TextStyle(color: Colors.white),
                ),
                subtitle: Text(
                  ' หมวดหมู่ : ${bookdata[index].Category}',
                  style: TextStyle(color: Colors.white),
                ),
                leading: SizedBox(
                  height: 60,
                  child: Image.network(bookdata[index].Imageurl),
                ),
                onTap: () {
                  Navigator.of(context).push(
                    MaterialPageRoute(
                      builder: (context) => BookDetile(
                        bookdataModel: bookdata[index],
                      ),
                    ),
                  );
                },
              ),
            );
          },
        ),
      ),
    );
  }
}
