import 'package:book_store/Data/Databook.dart';
import 'package:book_store/component/Icon/Icon_close.dart';
import 'package:book_store/component/Icon/Icon_search.dart';
import 'package:book_store/component/tabbar/TabbarBestsell.dart';
import 'package:book_store/component/tabbar/TabbarNewbook.dart';
import 'package:book_store/component/tabbar/TabbarReadfree.dart';
import 'package:book_store/component/tabbar/TabbarRecommend.dart';
import 'package:book_store/component/tabbar/Text_Appbar.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'Bookdetail.dart';
import 'Search.dart';

class NewBook extends StatefulWidget {
  static String name = 'Newbook';
  const NewBook({Key? key}) : super(key: key);

  @override
  _DownloadState createState() => _DownloadState();
}

class _DownloadState extends State<NewBook> {
  static List<String> booksname = [
    'ปริศนามหาเวทย์',
    'ห้วงหัวใจร่ายมนต์รัก',
    'CRYPTOCURRENCY 101 PLUS',
    'เปิดโลกการลงทุน ที่คุณยังไม่รู้มาก่อน',
    'Bitcoin Cryptocurrency',
    'ระบบอั่งเปาสะท้านภพ เล่ม 1',
    'ถ้าพ่อค้าจะครองโลก',
    'ซ่อนร้าย',
    'เล่ห์รักกับดักอสูร',
    'ยังคงรัก...',
    'มารักกัน',
    'มาเฟียต่างดาว',
  ];

  static List<String> Author = [
    "Tavy",
    "โนริ",
    "พรศักดิ์ อุรัจฉัทชัยรัตน์",
    "สิงหา พงศ์ศศิธร",
    "ธีระชัย ภูวนาถนรานุบาล",
    "知新 (จือซิน) / Liushu (นัฐกฤตา กุตนอก) แปล",
    "นายถั่วงอก",
    "ศิวารินทร์",
    "ปัณณดา",
    "นาริน",
    "นนท์วรินทร์",
    "ละอองหญ้า",
  ];

  static List<String> Category = [
    "นิยายแฟนตาซี",
    "นิยายรัก",
    "การเงินการลงทุน",
    "การเงินการลงทุน",
    "การเงินการลงทุน",
    "นิยายแฟนตาซี",
    "นิยายแฟนตาซี",
    "นิยายรัก",
    "นิยายรัก",
    "นิยายรัก",
    "นิยายรัก",
    "นิยายรัก",
  ];

  static List<int> Pagenum = [320, 213, 182, 100, 209, 383, 486, 783, 290, 112, 126, 287];

  static List<int> price = [160, 119, 225, 149, 196, 29, 190, 180, 99, 10, 49, 169];

  static List<String> Descriptions = [
    " “ปริศนามหาเวทย์” เป็นเรื่องราวของเด็กชายหญิงสองคน คือโรสกับดัดลีย์ซึ่งถูกสลับตัวแรกเกิดและได้หวนคืนสู่อ้อมอกครอบครัวที่แท้จริง โรสค้นพบเวทมนต์การแปลงร่างอันเป็นมรดกสืบทอด ทำให้เธอได้ผจญภัยและต่อสู้กับศัตรูหลากหลายรูปแบบ พบพานเรื่องลึกลับปมปริศนาจากตำราเวทมนต์ที่แม่ทิ้งเอาไว้ให้! มีทั้งเทพธิดาบินปร๋อ! นกแปลงร่างกลายเป็นหมา! แม่ชีแปลงเป็นเสาไฟฟ้า! แถมยังได้ต่อสู้เอาชนะศัตรูของพ่อให้กลายเป็นมิตรอีกด้วยโอ๊ย! ตื่นเต้นซะไม่มี",
    "นักข่าวสาวผู้อยากสลัดมาดแสนดีโนจุนวันแอบไปแสดงบทสาวเซ็กซี่เฉพาะกิจตอนไปทำข่าวรีสอร์ทสุดโรแมนติกกับช่างภาพหนุ่มสุดหล่อเพื่อนำมาเป็นประสบการณ์งานเขียนอันหวือหวาในมาดใหม่ของเธอช่างภาพมือฉมังเก่งกาจการถ่ายภาพนู้ดชุนมินซูคิดว่าแค่หวือหวาตอนสุดสัปดาห์ไร้พันธะอันใด ก็สาวคนนี้ช่างสวยเสียกระไร...แล้วเขาก็มุ่งแต่จะสร้างความก้าวหน้าในอาชีพลูกเดียวด้วยสิหากในโลกของความเป็นจริงนั้นทั้งสองยังต้องทำงานร่วมกัน แล้วใจอันผูกพันก็ไม่ยอมลี้หาย ความหลงใหลยังคงอยู่ แล้วเมื่อถึงเวลาต้องจากลากันไปคนละทางมนต์รักและอารมณ์เสน่หาก็ลึกล้ำเกินกว่าจะทำใจได้.... ห้วงหัวใจ ร่ายมนต์รัก ....เรื่องของความรัก ความพิศวาสอันร้อนเร่า",
    "Cyptocurrency 101 Plus ต่อยอดหนังสือขายดี Cyptocurrency 101 ที่ได้ปูพื้นความรู้ทั้งเรื่องคริปโตเคอเรนซี่ทั้งการก่อเกิด ธรรมชาติของมัน ไปจนถึงลงลึกภาคปฎิบัติเรื่องซื้อขาย การขุดเหรียญ รวมถึงความปลอดภัยต่างๆ ใน edition ใหม่นี้คุณจะได้รู้ทุกเรื่องที่ต้องรู้ก่อนคิดจะลงทุนกับเงินคริปโตอย่างเข้มข้นเช่นเดิม เพิ่มเติมด้วยเนื้อหาสุดอัปเดตในระบบนิเวศน์ของการเงินการลงทุนในสินทรัพย์ดิจิทัล ทั้งในเรื่องของ Defi (การเงินแบบกระจายศูนย์), NFT (สินทรัพย์ดิจิทัลที่ไม่อาจทำซ้ำ) เหรียญไหนที่น่าลงทุน และอื่นๆ เพื่อให้คุณเข้าใจมุมมองรอบด้าน หนทางในการลงมือปฎิบัติแบบอัปเดต เข้าใจทั้งประโยชน์และความเสี่ยง รวมถึงมิติด้านเศรษฐกิจและทิศทางภาครัฐที่ควรรู้ เพื่อคิดตัดสินใจในการลงทุนกับสินทรัพย์ดิจิทัลอย่างชาญฉลาดยิ่งขึ้น",
    "เปิดโลกการลงทุน ที่คุณยังไม่รู้มาก่อน…การลงทุนในโลกยุคใหม่ไม่ใช่เรื่องง่ายๆ แต่ก็ไม่ใช่เรื่องยากจนเกินไป อย่าให้อะไรมาจำกัดขีดความสามารถของคุณอยู่แค่การลงทุนบางสิ่งบางอย่าง หรือลงทุนได้แค่สิ่งเดียว แค่หุ้นหรือกองทุนรวม หรือลงทุนได้แค่แนวทางเดียว กราฟเทคนิคหรือดูพื้นฐาน หรือลงทุนแค่เพียงในประเทศอย่างเดียว เราต้องการแค่นั้นเองจริงๆ หรือ ?เราจะทำให้ได้ดีกว่ามากกว่าเดิมได้ไหม…หากเราจะลองท้าทายกรอบสามารถเดิมๆ ของตัวเอง ด้วยการลงทุนเป็นได้ด้วยตนเอง และลงทุนได้หลากหลายวิธี ซึ่งภายในหนังสือเล่มนี้ ได้รวบรวมเนื้อหาสาระสำคัญที่คุณควรต้องรู้ในโลกการลงทุนยุคนี้ ไว้ให้อ่านแล้วครบจบในเล่มเดียว ไม่ว่าจะเป็นการลงทุนหุ้น กองทุนรวม เงินสกุลดิจิทัล การจัดพอร์ตลงทุน และการลงทุนอื่นๆ โดยที่คุณสามารถได้ทั้ง Mindset + ดูพื้นฐาน + ใช้กราฟเทคนิคอล + จิตวิทยาการลงทุน เข้ามาช่วยวางแผนการลงทุนให้มั่นใจได้มากยิ่งขึ้นอย่าพลาดที่จะเรียนรู้การลงทุนได้ก่อนใคร โดยเฉพาะสถานการณ์โควิดแบบนี้ ต้องพลิกวิกฤตให้เป็นเป็นโอกาสทองของนักลงทุนรุ่นใหม่",
    "สำนักพิมพ์ เช็ก ราคาปก 245 บาท ลด 20 % คงเหลือ 196 บาทในอนาคต คริปโทจะมีความสำคัญเป็นส่วนหนึ่งในชีวิตประจำวัน จึงตัดสินใจเขียนบทความเพื่อเผยแพร่ความรู้ และบัดนี้ได้นำมาพิมพ์เป็นหนังสือ เพราะได้ประสบการณ์กับตนเองว่า ถ้าคนที่อธิบายเรื่องคริปโทใช้ประเด็นเทคนิคเป็นตัวนำก็จะเข้าใจได้ยากมาก ผมจึงเน้นการอธิบายจากแง่มุมเศรษฐศาสตร์การเงินสำหรับผู้ที่มีเงินออมและพร้อมจะลงทุนระยะยาว ถ้าหากศึกษาจนเข้าใจจังหวะวัฏจักรราคาขึ้นลง ถ้าหากสามารถแยกแยะเลือกคริปโทเคอร์เรนซีที่มีศักยภาพ ช่วงเวลายุคนี้เป็นโอกาสที่จะเลือกลงทุนเป็นโอกาสที่จะเกิดขึ้นเพียงไม่กี่ครั้งในรอบชีวิต",
    "“เย่จื่อเฉิน” นักศึกษาธรรมดา ถูกดึงเข้ากลุ่มวีแชทที่มีชื่อว่า ‘กลุ่มเทพเซียน’วันๆกลุ่มนี้นอกจากจะชอบหาเรื่องทะเลาะกันทุกวันแล้วยังชอบ ‘ส่งอั่งเปา’หากันอีกด้วย! ซุนหงอคงส่ง: เนตรอัคคี มองทะลุคุณสมบัติทุกอย่างบนโลก ผู้เฒ่าจันทราส่ง: ด้ายแดง ผูกชะตารักลิขิตใจ ไท่ซางเหล่าจวินส่ง: ยาวิเศษ ปลุกชีวิต ถึงแม้ใกล้ตาย หากกลืนเข้าไปก็กลับกลายเป็นหนุ่มสาว! แต่ทุกอย่างย่อมมีข้อแลกเปลี่ยน! พวกเทพเองก็ต้องการของวิเศษจากโลกมนุษย์เช่นกัน (สิ่งนั้นก็คือ...นมเปรี้ยวและน้ำอัดลม??) นั่นเลยทำให้เขาได้กลายเป็นสหายและพ่อค้าแลกเปลี่ยนสินค้ากับพวกเทพไปซะงั้น ทว่าเหตุผลแท้จริงที่ทำให้เขาถูกดึงเข้ากลุ่มมานั้นยังคงเป็นปริศนา... ยิ่งเย่จื่อเฉินอยู่ในกลุ่มนี้ไปเรื่อยๆ ก็ยิ่งเข้าใกล้คำว่า ‘เทพเซียน’ เข้าไปทุกขณะความสัมพันธ์ของเย่จื่อเฉินและเหล่าเทพจะเป็นอย่างไรต่อไป ติดตามต่อได้ใน “ระบบอั่งเปาสะท้านภพ”",
    "เป็นถึงอดีตนักเล่นเกมสายบู๊ที่ครองอันดับ 1 มาโดยตลอด แต่ตอนนี้ภาร์ได้ตัดสินใจเปลี่ยนเส้นทางสู่นักเล่นเกมสายการค้าอย่างเต็มตัวเพื่อทำให้ตัวเองกลายเป็นผู้ที่อยู่ในจุดสูงสุดของผู้เล่นที่มีอาชีพพ่อค้า ไม่ใช่ผู้เล่นสายการต่อสู้ แต่พอเข้าเกมมาก็ดันต้องมาเจอปัญหาสำคัญเพราะเผ่าพันธุ์มนุษย์ที่ภาร์เลือกเล่น ดันกลายเป็นเผ่าพันธุ์ที่ผู้เล่นและ NPC ทั่วโลกรังเกียจ ไหนจะถูกผู้เล่นอื่นตามล่าแถมตัวเองยังเป็นพวกชอบสร้างความวุ่นวายไปทั่ว แต่แล้วยังไงหล่ะ? เขาคือฟูเหลา...ชายผู้ไม่เคยแพ้ใครเชียวนะ ฉันจะกลายเป็นพ่อค้าที่ครอบครองทุกสิ่งและทำให้ผู้เล่นทุกคนสยบแทบเท้าด้วยอำนาจแห่งเงินตราเอง!!!",
    "กลางฟ้า นัก(อยาก)เขียนที่ต้องไปเป็นครูเพื่อหาเงินใช้ระหว่างเขียนนิยายเล่มแรกให้จบดันค้นพบโดยบังเอิญว่าพ่อของลูกศิษย์เป็นสมาชิกองค์กรเดือนลับองค์กรร้ายที่ตำรวจกำลังตามกวาดล้างอย่างหนัก แต่ก็เหมือนคว้าน้ำเหลวทุกครั้ง ความที่อยากได้ข้อมูลสำหรับเขียนนิยาย จึงตามสืบข้อมูลที่ได้รับมาด้วยตัวเอง แต่กลับถูกตามไล่ล่าจนแทบเอาชีวิตไม่รอดร้อยตำรวจมาริช ผู้กองรูปหล่อหุ่นแซบจึงถูกส่งตัวมาเพื่ออารักขากลางฟ้า ขณะเดียวกันก็จับตาพฤติกรรมของเธอไปด้วย ความใกล้ชิดที่มากขึ้น ทำให้เธอค้นพบบางอย่างในตัวเขาที่น่าพิศวงพอๆ กับองค์กรเดือนลับ แต่กว่าจะรู้ตัวว่ากำลังเข้าไปพัวพันกับความลับบางอย่างที่เป็นภัยต่อชีวิต กลางฟ้าก็ถอยไม่ได้แล้ว เช่นเดียวกับเสน่ห์ร้อนแรงของผู้กองมาริช ที่ทำให้เธอไม่สามารถถอนตัวออกมาได้เลย",
    "“คุณเชื่อฉันนะ ฉันไม่ได้ทำร้ายคุณอร” “ไม่ต้องพูดอะไรทั้งนั้น อยู่นิ่งๆ” เสียงคมเข้มดุดัน มองหญิงสาวตรงหน้าอย่างตำหนิ“คุณไม่เชื่อฉันเลย” ภาวิตาเสียงสั่น เจ็บปวดที่สุดคือภูวเดชไม่ยอมฟัง และไม่เชื่อเธอ“ผมบอกให้หยุดพูดไง คุณชอบขัดคำสั่งผมดีนัก ผมจะขังคุณไว้ในห้องจนกว่าผมจะกลับมา” เมื่อทายาเสร็จก็ลุกขึ้นเตรียมจะเดินออกจากห้อง ใบหน้าคมเข้ม มองหญิงสาวตรงหน้าอย่างเรียบเฉย ไม่ใช่ว่าเขาไม่เชื่อ แต่มันยากที่จะพูดออกมา เขาต้องขังเธอไว้ในห้อง เพื่อความปลอดภัยของเธอเอง“ฮือ คุณเดช..” “ผมจะพาอรพิมลกลับบ้าน” พูดเสียงเข้ม เหลือบตามองคนที่นั่งร้องไหนอยู่ข้างหลังเท่านั้น เดินออกมาเหมือนไม่รู้สึกอะไร แต่ข้างในใจของเขาเป็นห่วงเธอ และกังวลไปต่างๆนานาแล้ว ภาวิตามองตามหลังคนตัวใหญ่ทั้งน้ำตา มือบางกุมหน้าอกตัวเองไว้แน่น เจ็บปวดเหลือเกิน นี่สินะความเจ็บปวดของมือที่สามที่ต้องได้รับ สุดท้ายคนที่ภูวเดชรัก และเลือกคืออรพิมล เธอมันโง่ที่หลงรักคนใจร้าย คนเห็นแก่ตัวคนนี้ เธอมันโง่ที่ใจง่าย สมควรแล้วที่ต้องได้รับความเจ็บปวดแบบนี้",
    "เขากำลังจูบอยู่กับผู้หญิงคนอื่น... “พี่ภพ...” หรรษาเรียกชื่อเขาด้วยน้ำเสียงเบาหวิว ใจดวงน้อยรู้สึกเจ็บแปลบขึ้นมาทันที หญิงสาวค่อย ๆ เดินถอยหลังเพื่อหนีให้พ้นจากภาพบาดตาบาดใจตรงหน้า แต่กลับไม่ทันระวังดันชนเข้ากับแจกันใบใหญ่ที่วางประดับอยู่ในห้องทำงานจนมันเกิดเสียงดัง ซึ่งมันทำให้คนทั้งสองคนที่กำลังนั่งคลอเคลียกันอยู่ที่โซฟาต้องรีบผละออกจากกันอย่างรวดเร็ว “เอ่อ...ขอโทษที่เข้ามาขัดจังหวะค่ะ ษาขอตัวก่อนนะคะ” หรรษาเอ่ยด้วยน้ำเสียงติดจะสั่น พยายามกลั้นน้ำตาเอาไว้ไม่ให้รินไหลลงมาต่อหน้าเขา ก่อนจะเดินหันหลังเพื่อเตรียมตัวออกจากห้องทำงานของเขา",
    " “ในตู้เย็นไม่มีอะไรพอจะทำอาหารได้เลยครับ แต่ผมชงกาแฟไว้ให้ เอาไว้พรุ่งนี้ผมซื้อของสดมาใส่ตู้ให้นะครับ” วริศรายืนอ้าปากค้างมองเขาตาปริบ ๆ ยังจะมีพรุ่งนี้อีกเหรอ… ระหว่างเธอกับเขามันควรจะจบเรื่องในวันนี้สิ! “มะ ไม่ต้องหรอก ฉันไม่ชอบทำอาหาร อีกอย่าง… ฉันกับนายก็ไม่ได้เป็นอะไรกันด้วย อันที่จริง… นายควรจะลืมเรื่องเมื่อคืนนี้ไปได้แล้วนะ” แวบหนึ่งวริศราเหมือนเห็นแววตาตัดพ้อวูบวาบอยู่ในนั้น ก่อนเขาจะหันกลับไปวางแก้วสองใบไว้ที่เคาร์เตอร์ และเยื้องย่างสามขุมเข้ามาใกล้หญิงสาวจนแทบประชิด ใบหน้าหล่อเหลาเครียดขึงขึ้นอย่างน่าประหลาด “หัวหน้านี่เย็นชาจังนะครับ เรื่องเร่าร้อนขนาดนั้นจะให้ผมลืมได้ยังไง ไหนจะเสียงหวาน ๆ ของหัวหน้าอีก หัวหน้าลืมได้ยังไงครับ ทั้งที่เมื่อคืนเราดุเดือดกันขนาดนั้น… ว่าแต่… หัวหน้าลืมจริง ๆ เหรอครับ…” เขาตัดพ้อเสียงอ่อย พร้อมกันนั้นก็ส่งปลายนิ้วไปลากไล้ที่ต้นแขนนวลอย่างแผ่วเบา “แล้วสัมผัสแบบนี้… พอจะจำได้ไหมครับ”",
    " โจฮัน ไดริเกอร์ เขามาจากต่างดาวเพื่อทำภารกิจบางอย่างให้สำเร็จ มัดมุก มานีวัฒน์ เธอบังเอิญไปรู้ความลับของเขาโดยไม่ได้ตั้งใจ “นะ...นี่มันอะไรกัน” มัดมุกเอ่ยด้วยความตกใจเมื่อเห็นอุปกรณ์ต่าง ๆ ของเขา รวมถึงภาพบนหน้าจอที่กำลังฉายความน่ากลัวของดาวปิตูเรสอย่างน่าสยดสยอง เพราะบนจอมีภาพคนตายเกลื่อนกลาด ตามตัวของคนเหล่านั้นมีตุ่มสีดำพองขึ้นมาจนเธอแทบจะอาเจียน “คุณเข้ามาในห้องนี้ทำไม ออกไป” เสียงดุดันทางด้านหลังทำให้มัดมุกหันกลับไปมองด้วยความรวดเร็ว และเห็นว่าแววตาของเขาแข็งกร้าวอย่างน่ากลัว ก่อนจะเดินเข้ามาหาเธอด้วยท่าทางคุกคาม มัดมุกถอยหลังไปเรื่อย ๆ จนไปชนกับสวิตช์ปิดไฟ ห้องทั้งห้องจึงมืดลงทันที และนั่นก็ทำให้เธอเห็นว่าดวงตาของโจฮันเรืองแสง “คะ...คุณเป็นใคร คุณไม่ใช่มนุษย์” “ผมเป็นมนุษย์ แต่ไม่ใช่มนุษย์บนโลกของคุณ” “หมายความว่า...” “ผมเป็นมนุษย์ต่างดาว” “กรี๊ดดดดดดดดด”",
  ];

  static List url = [
    'https://fv9-3.failiem.lv/thumb_show.php?i=bp4atwr3p&download_checksum=2f97df51076e5a277d4db5e74414b8c648523950&download_timestamp=1632640732',
    'https://fv9-1.failiem.lv/thumb_show.php?i=cjwgubtnb&download_checksum=219471afd09b4734b7722e5ab78e84ccc13e06a3&download_timestamp=1632640755',
    'https://fv9-3.failiem.lv/thumb.php?i=b2r552yjs&download_checksum=02d669ca1c45be4e5f74d79b04cbec01b214b055&download_timestamp=1632640847',
    'https://fv9-1.failiem.lv/thumb.php?i=sztfbmdve&download_checksum=ce0b3d1d8ef77f8efd156adbce9614f73873d276&download_timestamp=1632640825',
    'https://fv9-2.failiem.lv/thumb_show.php?i=q622876u9&download_checksum=97e00a0df9ed7741a6956a0b372c515fd7e8c2fc&download_timestamp=1632640875',
    'https://fv9-2.failiem.lv/thumb_show.php?i=2z3ygmr3d&download_checksum=3f9fa5cc48f061c0c46babc14479560b36b3e677&download_timestamp=1632640897',
    'https://fv9-1.failiem.lv/thumb_show.php?i=d34dqc74s&download_checksum=9ed5f2b211b5e2baa7d369eca28e90f1c8c697f8&download_timestamp=1632640920',
    'https://fv9-3.failiem.lv/thumb_show.php?i=vvsg73jc5&download_checksum=e5778ba61d4ce99b6a10169c8eb73c8d50bcdf05&download_timestamp=1632640940',
    'https://fv9-1.failiem.lv/thumb_show.php?i=khveecmb6&download_checksum=d788d570f8eb922bd68e67b474795342f7c74633&download_timestamp=1632641088',
    'https://fv9-2.failiem.lv/thumb_show.php?i=taygubey5&download_checksum=a798cddd2c25d333b070ee300ee44a37930c31ba&download_timestamp=1632641105',
    'https://fv9-2.failiem.lv/thumb_show.php?i=8fzshhmpp&download_checksum=6e8bdc36ae133e943316814309c15f7bf53cd72f&download_timestamp=1632641125',
    'https://fv9-3.failiem.lv/thumb_show.php?i=33fgbaekp&download_checksum=85e87e7efecf5178231b3a8dbaf46a455dd4058a&download_timestamp=1632641138',
  ];

  final List<BookdataModel> bookdata = List.generate(
      booksname.length,
      (index) => BookdataModel(
            '${booksname[index]}',
            '${url[index]}',
            '${price[index]}',
            '${Descriptions[index]}',
            '${Author[index]}',
            '${Category[index]}',
            '${Pagenum[index]}',
          ));
  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      initialIndex: 1,
      length: 4,
      child: Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          backgroundColor: Colors.indigo,
          title: Text_Appbar(),
          leading: Icon(Icons.menu),
          actions: <Widget>[
            Icon_search(),
            Icon_close(),
          ],
          bottom: TabBar(
            tabs: <Widget>[
              TabbarRecommend(),
              TabbarBestsell(),
              TabbarNewbook(),
              TabbarReadfree(),
            ],
          ),
        ),
        body: ListView.builder(
          itemCount: bookdata.length,
          itemBuilder: (context, index) {
            return Card(
              child: ListTile(
                tileColor: Colors.indigo[300],
                title: Text(bookdata[index].name, style: TextStyle(color: Colors.white)),
                subtitle: Text('หมวดหมู่ : ${bookdata[index].Category}', style: TextStyle(color: Colors.white)),
                leading: SizedBox(
                  height: 60,
                  child: Image.network(bookdata[index].Imageurl),
                ),
                onTap: () {
                  Navigator.of(context).push(
                    MaterialPageRoute(
                      builder: (context) => BookDetile(
                        bookdataModel: bookdata[index],
                      ),
                    ),
                  );
                },
              ),
            );
          },
        ),
      ),
    );
  }
}
