import 'package:book_store/Data/Databook.dart';
import 'package:book_store/component/Icon/Icon_close.dart';
import 'package:book_store/component/Icon/Icon_search.dart';
import 'package:book_store/component/tabbar/TabbarBestsell.dart';
import 'package:book_store/component/tabbar/TabbarNewbook.dart';
import 'package:book_store/component/tabbar/TabbarReadfree.dart';
import 'package:book_store/component/tabbar/TabbarRecommend.dart';
import 'package:book_store/component/tabbar/Text_Appbar.dart';
import 'package:firebase_auth/firebase_auth.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'Detailbook.dart';
import 'Login.dart';
import 'Search.dart';

class ReadFree extends StatefulWidget {
  static String name = 'Readfree';
  const ReadFree({Key? key}) : super(key: key);

  @override
  _DownloadState createState() => _DownloadState();
}

class _DownloadState extends State<ReadFree> {
  static List<String> booksname = [
    'หนุ่มกาแฟกับสาววานิลลา 1',
    'ดรุณีชนะรัก',
    'จันทราธิษฐาน ตอนพิเศษ',
    'เทพแห่งสายลม',
    'การิน ปริศนาคดีอาถรรพ์ คดีที่ 1 คืนลอยกระทงสีเลือด',
    '30 บทเรียน: วิชาชีวิต',
    'ถ้ารู้แบบนี้ ฉันมีธุรกิจดีๆ ไปนานแล้ว',
    'มองมุมใหม่ : การเงินงอกเงย',
    'ชีวิตออกแบบได้',
    'เงินทองต้องวางแผน ตอน มนุษย์เงินเดือน ก็มั่งคั่งได้',
    '99 บทเรียน: วิชาชีวิต',
    'คู่มือการพูดในที่สาธารณะ (ฉบับที่คุณเองก็พูดได้)',
  ];

  static List<String> Author = [
    "AKEGAMI Takara",
    "ไนยาดา",
    "Andra",
    "Empsol",
    "ธอัยย์",
    "จักรายุธ มุ่งศิริ",
    "พันเอก ดร.อรรถสิทธิ์ หัสถีธรรม",
    "พรสรัญ รุ่งเจริญกิจกุล์",
    "Writer เจี๊ยบ Designer วิน",
    "ศูนย์ส่งเสริมการพัฒนาความรู้ตลาดทุน ตลาดหลักทรัพย์แห่งประเทศไทย",
    "จักรายุธ มุ่งศิริ",
    "Speak spark สปีค สปาร์ค - พูดได้ พูดดี พูดในที่สาธารณะ"
  ];

  static List<String> Category = [
    "การ์ตูนผู้หญิง",
    "นิยายโรมานซ์",
    "นิยายรัก",
    "นิยายแฟนตาซี",
    "การ์ตูนทั่วไป",
    "พัฒนาตนเอง",
    "บริหารจัดการ",
    "บริหารจัดการ",
    "พัฒนาตนเอง",
    "การเงินการลงทุน",
    "พัฒนาตนเอง",
    "พัฒนาตนเอง"
  ];

  static List<int> Pagenum = [190, 174, 51, 306, 146, 21, 142, 48, 112, 120, 50, 86];

  static List<String> price = [
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
    "free",
  ];

  static List<String> Descriptions = [
    "ริสะ นักศึกษาสาวเนื้อหอม คนรอบข้างมองว่าเธอเป็นดอกฟ้าผู้สูงส่ง แต่ที่จริงไม่เคยมีความรัก... และคนที่ปรากฏตัวต่อหน้าริสะที่ฝันหวานว่าอยากมีความรักที่สวีทหวานจนใจละลายคือชายหนุ่มสุดวิเศษผู้ดูดีในชุดสูท ความรักแบบปุบปับจนมือใหม่รับไม่ทัน...? จูบแรกกับคืนแรก... ความรักกับหนุ่มอายุมากกว่าซึ่งเต็มไปด้วยครั้งแรกนั้นฝาดขมแต่หวานจับใจ...!!",
    "ความรักก็เหมือนดอกไม้ถ้าแค่ชอบเราก็จะเด็ดมัน แต่ถ้ารักเราจะดูแลรดน้ำอย่างดี“มองทำไม?” ดอกไม้เอ่ยเสียงแข็ง “มองคนสวยไง มองตรงไหนก็สวย” ชนะตอบด้วยรอยยิ้มหวานเยิ้มทำเอาดอกไม้เองก็เขินไม่น้อยเลยถึงไม่ได้แสดงอาการอะไรออกมามากแต่แก้มและหูของเธอก็แดงก่ำ “แหม ๆ ไอ้ชนะจีบลูกสาวข้าต่อหน้าเลยนะ” ป้าศรียื่นต้นหอมให้ลูกสาว ชนะมองดูดอกไม้ที่กำลังซอยต้นหอมอยู่ด้วยรอยยิ้มเลยลุกเดินเข้าไปใกล้ ๆ ก่อนจะมองใบหน้าหวานอย่างเจ้าชู้ “ซอยแต่ต้นหอมไม่คิดจะซอยพี่บ้างเหรอจ๊ะ?” ก็สาวคนนี้ช่างสวยเสียกระไร...แล้วเขาก็มุ่งแต่จะสร้างความก้าวหน้าในอาชีพลูกเดียวด้วยสิหากในโลกของความเป็นจริงนั้นทั้งสองยังต้องทำงานร่วมกัน แล้วใจอันผูกพันก็ไม่ยอมลี้หาย ความหลงใหลยังคงอยู่ แล้วเมื่อถึงเวลาต้องจากลากันไปคนละทางมนต์รักและอารมณ์เสน่หาก็ลึกล้ำเกินกว่าจะทำใจได้.... ห้วงหัวใจ ร่ายมนต์รัก ....เรื่องของความรัก ความพิศวาสอันร้อนเร่า",
    "",
    "",
    "ลัลทริมา เด็กสาวผู้มีพลังพิเศษย้ายมายังโรงเรียนนิศาพาณิชย์ เธอต้องการใช้ชีวิตอย่างสงบสุขโดยปกปิดพลังพิเศษของตนเอง แต่ก็กลับต้องไปพัวพันในเหตุการณ์นักเรียนโดดตึกจนถูกเพื่อนร่วมชั้นเพ่งเล็ง ลัลทริมาต้องการค้นหาความจริงว่าใครอยู่เบื้องหลังเหตุการณ์นี้ ซึ่งเธอเชื่อว่านั่นเป็นฝีมือของ 'การิน' เด็กหนุ่มเพื่อนร่วมชั้นผู้คลั่งไคล้ศาสตร์อาถรรพ์เป็นชีวิตจิตใจ",
    "",
    "ตอนนั้น เมื่อสามสิบกว่าปีมาแล้ว ตอนที่ผมอายุยี่สิบเศษๆ ผมเกิดความรู้สึกอยากรวย อยากมีรายได้มากกว่าเงินเดือนที่ผมได้รับจากการเป็นมนุษย์เงินเดือน ผมจึงสร้างธุรกิจเล็กๆ ขึ้นมา ผมมันด้วยความตั้งใจ และความทุ่มเท แต่ท่านรู้ไหมว่า อะไรเกิดขึ้นกับผม...ก็เจ๊งไงล่ะครับ... ท่านไม่จำเป็นต้องเป็นอย่างผม ไม่จำเป็นต้องล้มเหลวอย่างผม ไม่จำเป็นต้องเป็นหนี้สินอย่างผม ผมได้นำเอาบทเรียนราคาแพงข้างต้น ที่ผมได้สั่งสมมาในช่วงสามสิบกว่าปีมานี้ มาร้อยเรียงให้มาอยู่ในหนังสือเล่มนี้ ที่มีชื่อว่า “ถ้ารู้แบบนี้ ฉันมีธุรกิจดีๆ ไปนานแล้ว” ซึ่งเป็นหนังสือเล่มเล็กๆ ที่จะช่วยให้ท่านไม่ผิดพลาดแบบผม และสามารถสร้างธุรกิจในฝันของท่านให้สอดคล้องกับความเป็นจริง และทำให้มันเป็นจริงได้อย่างมืออาชีพ แล้วนำมาซี่งความสุข และความมั่งคั่งร่ำรวยให้กับท่าน จงอย่าเป็นเหมือนผมในอดีต แต่จงเรียนรู้จากผม แล้วทำให้ความฝันทางธุรกิจของท่านให้เป็นจริงอย่างมืออาชีพ",
    "การบริหารจัดการด้านการเงินเป็นเรื่องที่ทุกคนต้องเรียนรู้ บทความต่างๆ ในเล่มนี้จะช่วยให้เห็นภาพรวมว่าเราจะประสบความสำเร็จและมีอิสรภาพทางการเงินได้อย่างไร ซึ่งจะเพิ่มความเชื่อมั่นในการสร้างความมั่นคงทางการเงินตั้งแต่วัยทำงานไปจนถึงวัยเกษียณอย่างมีความสุข",
    "เชื่อว่า หลายคนน่าจะเกิดความสงสัยว่าทั้ง ๆ ที่ใช้ชีวิตมานานระยะหนึ่งแล้ว ทำไมชีวิตถึงไม่เป็นไปตามที่เคยวาดฝันไว้ หน้าที่การงานก็ไม่ก้าวหน้าอย่างที่ตั้งใจ ทำไมเราไม่ประสบความสำเร็จเสียที เฝ้าถามตัวเองว่ามีอะไรที่ทำพลาดไป มีอะไรที่เป็นแรงเสียดทาน ? คำตอบของคำถามนี้คือ เราปล่อยชีวิตให้ล่องลอยไปตามยถากรรม และ ไม่เชื่อว่า “ชีวิตออกแบบได้” ทั้งที่เราสามารถออกแบบชีวิตตัวเองได้อยู่แล้ว แต่กลับปล่อยให้คนอื่นเป็นผู้ควบคุมการใช้ชีวิตของเรา แต่เมื่อไรที่เรากลับมาเชื่อว่า “ชีวิตออกแบบได้” เราจึงจะก้าวข้ามสิ่งกีดขวางที่เป็นความเชื่อแบบเดิม ๆ รวมทั้งแรงเสียดทานที่ทำให้ตัวเราไม่ประสบความสำเร็จ เรื่องที่เรา 2 คน Writer เจี๊ยบ และ Designer วิน อยากจะแชร์ เรียกว่าเป็น ปัจจัย หรือ หนทาง หรือ แรงบันดาลใจ หรือ คำแนะนำ… จะใช้คำจำกัดความว่าอะไรก็ได้ แต่สิ่งที่นำเสนอ คือวิธีการก้าวข้ามอุปสรรค หรือข้อจำกัดที่ปิดกั้นเราไว้จากความสำเร็จ เรื่องพวกนี้ส่วนใหญ่มาจากสิ่งที่อยู่ภายในของแต่ละคน โดยเฉพาะความคิดที่ทำให้ไม่สามารถพาตัวเองออกจากคำว่า ไม่สำเร็จ ให้ไปถึง ความสำเร็จ ลองทบทวนดี ๆ อาจเจอว่ามีเพียงคนเดียวที่หยุดเราไว้ ไม่ยอมอนุญาติให้เราประสบความสำเร็จ นั้นคือตัวเราเอง !! สิ่งที่เราถ่ายทอด ล้วนเป็นเรื่องที่เรา 2 คนเคยลงมือทำ ต่อสู้กับอุปสรรคที่เกิดขึ้น และได้เรียนรู้มาแล้วจากประสบการณ์ตรง จึงเชื่ออย่างหมดใจและแน่ใจว่าเนื้อหาที่ส่งต่อนี้ ถ้าท่านมีความเชื่อเหมือนที่เราเชื่อ ความเชื่อนั้นจะช่วยนำพาท่านไปถึงเป้าหมายได้แน่นอน เช่นเดียวกับที่เคยพาชีวิตเรา 2 คนให้ผ่านอุปสรรค กระทั่งทำให้ไปถึงความฝันได้แล้วเช่นกัน ตัวอย่างที่เห็นชัดเจนที่สุดคือ เพจในเพสบุค คลิปในยูทูบ รวมถึงหนังสือเล่มนี้ ที่ครั้งแรกเป็นแค่แนวคิด แค่ความฝัน ของเรา 2 คน แต่ตอนนี้กลายเป็นความจริงที่จับต้องได้ โดยเดินตามปัจจัยแห่งความสำเร็จทั้ง 5 ข้อที่จะนำเสนอต่อไป ขอแค่ให้เชื่อว่า “ชีวิตออกแบบได้” และคนที่ออกแบบคือตัวเรานี่เองแหละ ท่านก็จะประสบความสำเร็จในชีวิตแน่นอน",
    "เพื่อให้มนุษย์เงินเดือนสามารถวางแผนทางการเงินได้อย่างมีประสิทธิภาพ มีความสุขและความมั่งคั่งไปพร้อมๆ กัน เนื้อหากล่าวถึงการปลดหนี้ การออมเงิน การนำเงินออมไปลงทุนเพื่อสร้างผลตอบแทน และการเตรียมตัวรับวัยเกษียณ",
    "",
    "“จงเป็นคนที่โดดเด่น ด้วยทักษะการพูดในที่สาธารณะ” ด้วย “คู่มือการพูดในที่สาธารณะ (ฉบับที่คุณเองก็พูดได้)” คู่มือเล่มนี้ได้กลั่นกรองสุดยอด “ใจความสำคัญ” เพื่อใช้เป็น “คู่มือประจำตัว” สำหรับผู้ที่กำลังฝึกฝนทักษะการพูดในที่สาธารณะ และ ผู้ที่ปรารถนาจะออกไปจับไมค์พูดต่อหน้าคนจำนวนหนึ่งได้ ศตวรรษที่ 21 นี้ โลกยุคใหม่เปลี่ยนแปลงไปอย่างรุนแรงและรวดเร็ว ชนิดที่เอาช้างมาฉุดก็หยุดไม่อยู่ เป็นยุคที่เทคโนโลยีก้าวหน้าจนเกิดการพัฒนานวัตกรรมใหม่ๆ อันเกิดคุณค่าต่อโลกใบนี้ แน่นอนว่าการเปลี่ยนแปลงดังกล่าว ทำให้ความท้าทายหรือปัญหาที่เจอในชีวิตประจำวันซับซ้อนกว่าโลกยุคเดิม ทำให้การจ้างงานและความต้องการของตลาดแรงงานเปลี่ยนแปลงไป “ทักษะการสื่อสาร” เป็นหนึ่งในทักษะที่มีความจำเป็นมากขึ้น เพราะ “ทักษะการพูดหรือความสามารถด้านการสื่อสาร มีความสำคัญอย่างยิ่ง ในแง่การถ่ายทอดความคิด หรือ ไอเดีย ออกมา ให้ผู้คนเข้าใจได้อย่างเป็นรูปธรรม” อันส่งผลต่อ “ความก้าวหน้าและความอยู่รอด” ของมนุษย์ เมื่อรู้เช่นนี้แล้ว มาเริ่มต้นฝึกฝนทักษะการพูดในที่สาธารณะกันเถอะ! เพราะ “เราอยู่ในยุคที่ ใครมีทักษะการพูดในที่สาธารณะ คนนั้นโดดเด่น!”",
  ];
  static List url = [
    'https://fv9-2.failiem.lv/thumb_show.php?i=nhdgyamk8&download_checksum=487328169c493d136a914ed670b6283e06cc4938&download_timestamp=1632657893',
    'https://fv9-1.failiem.lv/thumb_show.php?i=r63qtw8ez&download_checksum=c8987294f4ebb13910e200af7b94b61a8c642fa7&download_timestamp=1632658027',
    'https://fv9-2.failiem.lv/thumb_show.php?i=pdtgb56nu&download_checksum=62d55351d05453c44b800309df360a94b918d9ad&download_timestamp=1632658045',
    'https://fv9-2.failiem.lv/thumb_show.php?i=h353a8bry&download_checksum=4a645561325d0678cdee1e43b1e2923a3240d8f9&download_timestamp=1632658062',
    'https://fv9-3.failiem.lv/thumb_show.php?i=pfhzrhxm6&download_checksum=c58646b71b892391146d8a27b56be1c2dbea95f2&download_timestamp=1632658077',
    'https://fv9-3.failiem.lv/thumb_show.php?i=6vpmfuk5g&download_checksum=b576b8cb6ffbca8b112a2cdae955b98d70b1a1e9&download_timestamp=1632658097',
    'https://fv9-1.failiem.lv/thumb_show.php?i=4dtxapxk8&download_checksum=c1f73b70323c011fa8dcb1f64c8896416c1e74c1&download_timestamp=1632658111',
    'https://fv9-2.failiem.lv/thumb_show.php?i=uyhs6tfrg&download_checksum=24ceb064ead3a975c502b1f463cdd20677f03130&download_timestamp=1632658142',
    'https://fv9-2.failiem.lv/thumb_show.php?i=kxyyfhh5q&download_checksum=0af00398f9779aaeb756dc9ce30593cf45a3e091&download_timestamp=1632658163',
    'https://fv9-2.failiem.lv/thumb_show.php?i=mk2u8pbyj&download_checksum=f0a866f95f325bc1964fb1c507aa6db6a23f8f8d&download_timestamp=1632658217',
    'https://fv9-2.failiem.lv/thumb_show.php?i=f7mb59nwf&download_checksum=237930b61921a219495d568eb64f6487880b966f&download_timestamp=1632659936',
    'https://fv9-2.failiem.lv/thumb_show.php?i=9kcx6vq7u&download_checksum=a029233ed2c6ba74f569bf12575a09ed50e080ef&download_timestamp=1632659954',
  ];

  final List<BookdataModel> bookdata = List.generate(
      booksname.length,
      (index) => BookdataModel(
            '${booksname[index]}',
            '${url[index]}',
            '${price[index]}',
            '${Descriptions[index]}',
            '${Author[index]}',
            '${Category[index]}',
            '${Pagenum[index]}',
          ));
  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      initialIndex: 1,
      length: 4,
      child: Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          backgroundColor: Colors.indigo,
          title: Text_Appbar(),
          leading: Icon(Icons.menu),
          actions: <Widget>[
            Icon_search(),
            Icon_close(),
          ],
          bottom: TabBar(
            tabs: <Widget>[
              TabbarRecommend(),
              TabbarBestsell(),
              TabbarNewbook(),
              TabbarReadfree(),
            ],
          ),
        ),
        body: ListView.builder(
          itemCount: bookdata.length,
          itemBuilder: (context, index) {
            return Card(
              child: ListTile(
                tileColor: Colors.indigo[300],
                title: Text(bookdata[index].name, style: TextStyle(color: Colors.white)),
                subtitle: Text('หมวดหมู่ : ${bookdata[index].Category}', style: TextStyle(color: Colors.white)),
                leading: SizedBox(
                  height: 60,
                  child: Image.network(bookdata[index].Imageurl),
                ),
                onTap: () {
                  Navigator.of(context).push(
                    MaterialPageRoute(
                      builder: (context) => DetileBook(
                        bookdataModel: bookdata[index],
                      ),
                    ),
                  );
                },
              ),
            );
          },
        ),
      ),
    );
  }
}
