import 'package:book_store/Data/Bookdata.dart';
import 'package:book_store/component/Mybook.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class Recommended extends StatefulWidget {
  static String name = 'recommended for you';
  const Recommended({Key? key}) : super(key: key);

  @override
  _RecommendedState createState() => _RecommendedState();
}

class _RecommendedState extends State<Recommended> {
  List<BookData> books = [
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=8ba49jd88&download_checksum=e2df36cc2fa28338953692b97b7d61f5e46094bd&download_timestamp=1632574065",
        " ALICE อลิซ",
        "Christina Henry",
        "เชื่อกันว่าโรงพยาบาลจิตเวชแห่งนี ้มีอสุรกายหลับใหลอยู่ในห้องใต้ดิน ตั้งแต่มาอยู่ที่นี่ อลิซ ก็ต้องเผชิญฝันร้ายทุกคืนงานเลี้ยงที่จบลงด้วยเลือด กระต่ายผู้ลึกลับที่จับจ้องเธอในเงามืด เรื่องเลวร้ายในอดีตทำให้เธอสูญเสียความทรงจำ กระต่าย ที่ปรากฏในฝันคือผู้กุมความลับทั้งหมดอลิซต้องออกตามหากระต่ายไปถึงดินแดนพิศวง ซึ่งมีทั้งผู้วิเศษและปีศาจจำแลงในร่างมนุษย์แต่การเดินทางของเธอกลับปลุกอสุรกายให้ตื่นขึ้นเมื่อคมเขี้ยวของมันขยับเข้าใกล้ อลิซคงอยากภาวนาให้ทุกอย่างเป็นเพียงฝันร้าย",
        400,
        4.8,
        "327"),
    BookData(
        "https://fv9-1.failiem.lv/thumb_show.php?i=3amssza8u&download_checksum=b8ca2e3ae1aadf17419d2046e408a4d8c6ca1a2a&download_timestamp=1632574102",
        " แด่เธอผู้เปล่งประกายใต้แสงจันทร์",
        "ซาโนะ เท็ตสึยะ",
        "คนที่ความตายคืบใกล้เข้ามาทุกที กับคนที่มีชีวิต โดยรู้สึกอยากตาย ใครที่น่าเศร้ากว่ากัน ตั้งแต่คนสำคัญจากไปผมใช้ชีวิตแบบซังกะตายวันแล้ววันเล่าจนวันหนึ่ง มีเหตุให้ผมต้องเข้าไปพัวพันกับเด็กสาวคนหนึ่ง เธอเข้ารับการรักษาตัวอยู่ในโรงพยาบาลด้วย โรคเปล่งแสง โรคที่แสนสวยงามและน่าเศร้าในเวลาเดียวกันเมื่อต้องแสงจันทร์ ร่างกายของผู้ป่วยจะเปล่งแสงเรืองรองและยิ่งใกล้ระยะสุดท้าย แสงนั้นจะยิ่งเจิดจ้าขึ้นเรื่อยๆ ด้วยความที่ผมทำของสำคัญของเธอพังผมจึงต้องทำหน้าที่ทำ สิ่งที่อยากทำก่อนตาย แทนแล้วนำมาเล่าให้เธอฟังนับจากสัญญาในวันนั้นช่วงเวลาที่หยุดนิ่งของผมก็พลันกลับมาเคลื่อนไหว ",
        0,
        3.5,
        "208"),
    BookData(
        "https://fv9-2.failiem.lv/thumb_show.php?i=rep9kuvdx&download_checksum=3e117765c6dd737bf2ebd3b85bfa0c8abe708297&download_timestamp=1632574127",
        "ปราชญ์แห่งธนู THE ARCHER",
        " Paulo Coelho ",
        "The Archer ปราชญ์แห่งธนู จะพาคุณไปพบกับความหมายของชีวิต ผ่านสายตาและวิถีของนักยิงธนู ที่จะทำให้คุณได้ตั้งคำถามและค้นหาคำตอบที่จะสั่นสะเทือนความรู้สึกคุณไม่แพ้ “ขุมทรัพย์สุดปลายฝัน” นี่คือปรัชญาชีวิตอันงดงาม ที่คุณจะได้ซึมซับผ่านเรื่องราวของ เทะสึยะ ชายผู้เคยมีชื่อเสียงเพราะพรสวรรค์ระดับอัจฉริยะในด้านการยิงธนู ฝีมือของเขาล้ำเลิศยากจะหาผู้ใดทัดเทียมได้ แต่ชื่อเสียงและการยอมรับ กลับเป็นสิ่งที่เขาเดินหันหลังให้ และเลือกที่จะหลบลี้ผู้คนไปเป็นเพียงช่างไม้ที่ไร้คนรู้จัก แต่แล้ววันหนึ่งก็มีชายแปลกหน้าออกเดินทางตามหาเพื่อขอประลองฝีมือกับเทะสึยะ เพื่อหาคำตอบว่าเขายังเป็นนักยิงธนูฝีมือชั้นครูอยู่หรือไม่ ชายแปลกหน้าผู้นั้นถามหาเขาจากเด็กชายคนหนึ่งในหมู่บ้านที่นำเขาไปพบกับเทะสึยะ ",
        152,
        2.7,
        "191"),
    BookData(
        "https://fv9-2.failiem.lv/thumb_show.php?i=zjrj4hfs7&download_checksum=8af2ce2c7fe5fc3d2a279b2d00d3e4ca62d28eb9&download_timestamp=1632574145",
        "ลวงร้ายรัก",
        " แชนเดอเลียร์",
        "บาดแผลแห่งรอยบาปที่ติดอยู่ในใจ ทำให้กาบมณีอุทิศชีวิตอันว่างเปล่าที่เหลือ อาสาเข้าร่วมทีมแพทย์รักษ์ด้วยภักดี หน่วยแพทย์เคลื่อนที่เพื่อผู้ยากไร้เข้าช่วยเหลือเหตุการณ์ก่อกบฏของรัฐตาลูลา ตามคำขอของผู้สืบทอดตำแหน่งคนล่าสุด เธอหอบความช้ำไปสุดหล้าฟ้าเขียวพร้อมกับความสำนึกผิดที่เคยทำบางอย่างผิด พลาดร้ายแรง แต่แล้วที่นั่นเธอกลับได้พบเกล้าเศียรอีกครั้ง ในฐานะกุมารแพทย์คนใหม่ของทีมอาสา บุคคลที่เธอไม่อยากเจอที่สุดในชีวิต เพราะเขาเกลียดชังเธอเข้ากระดูกดำ ทว่าโชคชะตาก็ลิขิตให้พวกเขาเริ่มต้นพัวพันกันอีกครั้ง แถมภารกิจอาสาของเธอยังต้องดูแลใกล้ชิดผู้สืบทอดคนสำคัญของตาลูลาถึงบนเตียง! สามปีที่ไม่พบหน้า หนึ่งปีที่เธอชดใช้ความผิดให้เขาไปหมดแล้ว ท่ามกลางสมรภูมิรบ กลิ่นคาวเลือด และเสียงระเบิดกัมปนาทที่ดังกึกก้อง แต่สองหัวใจที่เคยบาดหมางกลับว่างวาบด้วยความรู้สึกใหม่",
        0,
        3.7,
        "204"),
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=vgpcud77z&download_checksum=6ba82ebfd7fa34eacdbe1f7351dc2579af210d5b&download_timestamp=1632574166",
        " เป็นสตรีต้องมีสมอง",
        "ฉางเยว่",
        "'ซ่งเชียน' ไม่เข้าใจว่าตนเองผิดพลาดประการใดจึงทำให้คู่หมั้นไปมีหญิงอื่นท่าทีโลเลอยากจะเก็บสตรีสองนางไว้ข้างกายทำให้นางโมโหจนต้องการถอนหมั้น แต่จะทำอย่างไรให้ตนเองบริสุทธิ์ ให้ชายหญิงคู่นั้นรู้สำนึก ขณะที่ดำเนินแผนการก็มี คนผู้หนึ่ง สอดมือเข้ามายุ่งตลอดโดยที่ไม่ได้ขอ!",
        0,
        3.8,
        "436"),
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=fg79ftqdf&download_checksum=47932be6dd20b7a0e8f33ce49a00ab2292b56333&download_timestamp=1632574186",
        " สายหมอกและดอกหญ้า",
        " ดวงตะวัน",
        "สองปีก่อน ราชสีห์บุกทลายโกดังกักตุนหน้ากากอนามัยและเวชภัณฑ์พ่อของ มิลิน ถูกฆ่าตายคาโกดัง วันนี้เด็กสาวกลับมาล้างแค้นในวันที่ราชสีห์สิ้นลาย ไร้พวกเหลืออยู่แต่ The Prince ซึ่งไม่นิยมความรุนแรงปรินทร์ส่งดวิษ ไปรับมือเด็กสาวที่สะกดคำว่าให้อภัยไม่เป็นทั้งไม่แยแสการปล่อยวาง ดวิษเข้าใจความแค้นของเธอ เพราะผู้หญิงที่เขารักก็ตายจากไปเช่นกันพลันที่หมอกหนาทึบจางหายด้วยแสงรักแรงกล้าจากหัวใจดวงเล็กๆ เส้นทางแห่งการแก้แค้นของหนุ่มสาวจึงมาบรรจบเจอกัน แต่...ภาพที่ดวิษและมิลินมองเห็น กลับดูคล้ายว่า The Prince กำลังถลกหนังหัวราชสีห์",
        0,
        3.2,
        "327"),
    BookData(
        "https://fv9-1.failiem.lv/thumb_show.php?i=sn7pgwd7c&download_checksum=5eedc3b6b813b0052eb29e38bb154ca2de0244ab&download_timestamp=1632574207",
        " ดาบธีลา",
        " ดวงตะวัน",
        "บนแนวกำแพงโบราณหน้าปราสาทชาบีนวาส ปรากฏรูปสลักดาบซึ่งมีดอกไม้งามทอดยอดเกี่ยวพันที่ปลายแหลมคมรู้จักกันในชื่อ ดาบธีลา ไม่มีใครรู้ที่มาหรือความหมายแท้จริงของมันด้วยบันทึกในหน้าประวัติศาสตร์เชบีนบอกเพียงว่าบรรพบุรุษเจ้าของปราสาทแห่งนี้ คือเจ้าชายปลายแถวแห่งชาบีนวาส นายทาสผู้อำมหิต ทั้งยังเชื่อกันว่า มีหญิงสาวจากแดนไกล ถูกไล่ล่าจับตัวมาเป็นทาสอยู่ที่นี่น่าแปลกก็ตรงที่ หากเจ้าชายแห่งชาบีนวาส คือนายทาสผู้น่าชังเหตุไฉน ธีลา ดอกงามจึงเบ่งบานอวดโฉมอยู่ที่ปลายดาบคม ใครกันแน่ คือพ่อค้าทาสผู้สามานย์ และเรื่องราวแท้จริงเบื้องหลังประวัติศาสตร์การค้าทาสแห่งเชบีนเป็นเช่นไร คำตอบอาจเป็นดั่งถ้อยคำในภาษาธิมาส์โบราณ เอลันตระดารายาวีไลย์-อะไรๆ ก็เกิดขึ้นและเป็นจริงได้เสมอ",
        560,
        3.2,
        "320"),
    BookData(
        "https://fv2-1.failiem.lv/thumb_show.php?i=3xjvg6cpk&download_checksum=ba51ae7a7b35d20c31b44948d5d3bdc6485742ef&download_timestamp=1632581533",
        "แฮร์รรี่ พอตเตอร์กับศิลาอาถรรพ์",
        "J.K. Rowling",
        "ชีวิตของแฮร์รี่ พอตเตอร เปลี่ยนไปตลอดกาลในวันเกิดปีที่ 11 เมื่อรูเบอัส แฮกริด ยักษ์ใหญ่ดวงตาคล้ายด้วงมาส่งจดหมายและแจ้งข่าวชวนประหลาดใจ แฮร์รี่ พอตเตอร์ ไม่ใช่เด็กธรรมดาๆ เขาเป็นพ่อมดและการผจญภัยสุดมหัศจรรย์กำลังจะเริ่มต้น",
        256,
        4.8,
        "1572"),
    BookData(
        "https://fv2-4.failiem.lv/thumb_show.php?i=u4xsxcacu&download_checksum=b5542e57bc7e9e1439e10818225ddac1796105b2&download_timestamp=1632581560",
        " แฮร์รี่ พอตเตอร์กับห้องแห่งความลับ",
        "J.K. Rowling",
        "ปิดเทอมหน้าร้อนนี้ แอร์รี่ พอตเตอร์ได้พบเจอวันเกิดที่แย่ที่สุดในชีวิต มาพร้อมคำเตือนที่เป็นลางร้ายจากด็อบบี้ เอลฟ์ประจำบ้านก่อนที่รอน วิสลีย์เพื่อนรักจะขับรถเหาะมาพาเขากนีออกจากบ้านเดอร์สลียืได้ในที่สุด! เมื่อกลับไปเรียนปีสองที่โรงเรียนพ่อมดแม่มดและเวทมนตร์คาถาศาสตร์ฮอกวอตส์ แฮร์รี่ได้ยินเสียงกระซิบแปลกๆ ที่คนอื่นไม่ได้ยิน จากนั้นการทำร้ายก็เริ่มขึ้น นักเรียนหลายคนถูกพบกลายเป็นหิน.....ดูเหมือนว่าคำทำนายน่ากลัวของด๊อบบี้กำลังจะเป็นจริงเสียแล้ว",
        392,
        3.5,
        "335"),
    BookData(
        "https://fv2-3.failiem.lv/thumb_show.php?i=meu4cu36h&download_checksum=f52ea2e30b555a655543a0da89ebb6f967f4338a&download_timestamp=1632581601",
        "แฮร์รี่พอตเตอร์ กับนักโทษแห่งอัซคาบัน",
        " J.K. Rowling",
        "The Archer ปราชญ์แห่งธนู จะพาคุณไปพบกับความหมายของชีวิต ผ่านสายตาและวิถีของนักยิงธนู ที่จะทำให้คุณได้ตั้งคำถามและค้นหาคำตอบที่จะสั่นสะเทือนความรู้สึกคุณไม่แพ้ “ขุมทรัพย์สุดปลายฝัน” นี่คือปรัชญาชีวิตอันงดงาม ที่คุณจะได้ซึมซับผ่านเรื่องราวของ เทะสึยะ ชายผู้เคยมีชื่อเสียงเพราะพรสวรรค์ระดับอัจฉริยะในด้านการยิงธนู ฝีมือของเขาล้ำเลิศยากจะหาผู้ใดทัดเทียมได้ แต่ชื่อเสียงและการยอมรับ กลับเป็นสิ่งที่เขาเดินหันหลังให้ และเลือกที่จะหลบลี้ผู้คนไปเป็นเพียงช่างไม้ที่ไร้คนรู้จัก แต่แล้ววันหนึ่งก็มีชายแปลกหน้าออกเดินทางตามหาเพื่อขอประลองฝีมือกับเทะสึยะ เพื่อหาคำตอบว่าเขายังเป็นนักยิงธนูฝีมือชั้นครูอยู่หรือไม่ ชายแปลกหน้าผู้นั้นถามหาเขาจากเด็กชายคนหนึ่งในหมู่บ้านที่นำเขาไปพบกับเทะสึยะ ",
        480,
        3.7,
        "420"),
    BookData(
        "https://fv2-4.failiem.lv/thumb_show.php?i=5sryzkurj&download_checksum=7e57e837ed53cf267063a81349558bfc256cd501&download_timestamp=1632581693",
        "แฮร์รี่ พอตเตอร์กับถ้วยอัคนี",
        "J.K. Rowling",
        "การประลองเวทไตรภาคีกำลังจะจัดขึ้นที่ฮอกวอตส์ พ่อมดอายุสิบเจ็ดปีขึ้นไปเท่านั้นถึงจะมีสิทธิ์เข้าแข่ง แต่แฮร์รี่ก็ยังอดฝันไม่ได้ว่าตัวเองเป็นผู้คว้าชัย และแล้วในวันฮาโลวีน แฮร์รี่ก็ต้องตกตะลึงเมื่อถ้วยอัคนีเลือกเขาให้เป็นหนึ่งในตัวแทนโรงเรียนเข้าประลองเวท เขาต้องเผชิญภารกิจอันตรายหลายอย่าง รวมถึงมังกรและพ่อมดศาสตร์มืด แต่ด้วยความช่วยเหลือจากรอนและเฮอร์ไมโอนี่เพื่อนรัก แฮร์รี่อาจผ่านทุกอย่างได้ โดยยังรอดตาย!",
        832,
        3.7,
        "590"),
    BookData(
        "https://fv2-4.failiem.lv/thumb_show.php?i=fnsgtgsv7&download_checksum=c11134eb2eb7f8d127af09932a4dd4d95bbfdfb0&download_timestamp=1632581646",
        "แฮร์รี่ พอตเตอร์กับภาคีนกฟีนิกซ์",
        "J.K. Rowling",
        "กลับมาอีกครั้งสำหรับพ่อมดหนุ่มน้อยวัยสิบห้าปีที่ทุกคนทั่วโลกรอคอยเขาอยู่ พบกับการผจญภัยของ 'แฮร์รี่ พอตเตอร์' ครั้งล่าสุดที่เริ่มขึ้นแล้ว มาติดตามและร่วมลุ้นว่าใครในเล่มนี้ต้องจบชีวิตลง มักเกิ้ลทุกคนเตรียมผ้าเช็ดหน้ามาซับน้ำตาได้เลย แล้วคำว่า ภาคีนกฟีนิกซ์ ที่มาจากในภาษาอังกฤษ The Order of the Phoenix นั้นคืออะไร ไปหาคำตอบจากในเล่มกันเอาเองดีกว่า รับรองว่าตอนนี้สนุกไม่แพ้ตอนอื่นๆ เช่นกัน",
        1088,
        4.5,
        "590"),
    BookData(
        "https://fv2-2.failiem.lv/thumb_show.php?i=x37ayrdmr&download_checksum=5abd1ee7afab52edc8e9450800f90f6f93fe4caa&download_timestamp=1632581620",
        " แฮร์รี่ พอตเตอร์กับเจ้าชายเลือดผสม",
        " J.K. Rowling",
        "กลางดึกช่วงปิดเทอมฤดูร้อน ดัมเบิลดอร์มารับแฮร์รี่ พอตเตอร์ที่ซอยพรีเว็ต มือข้างหนึ่งของอาจารย์ดำเกรียมและแห้งเหี่ยว แต่เขาไม่ยอมบอกเหตุผล ความลับและความหวาดระแวงแพร่กระจายไปทั่วโลกเวทมนตร์และฮอกวอตส์ก็ไม่ปลอดภัย แฮร์รี่เชื่อว่ามัลฟอยถูกประทับตรามารแล้ว... นั่นเท่ากับมีผู้เสพความตายอยู่ใกล้ตัวเขา แฮร์รี่เริ่มสำรวจความลับดำมืดที่สุดของโวลเดอร์มอร์ เขาต้องการเวทมนตร์ทรงพลังและเพื่อนแท้อยู่ข้างกาย ขณะที่ดัมเบิลดอร์เตรียมแฮร์รี่ให้พร้อมเผชิญชะตากรรมของตัวเอง...",
        680,
        4.2,
        "505"),
    BookData(
        "https://fv2-2.failiem.lv/thumb_show.php?i=adsrmyw3a&download_checksum=d08f862fd92f4ce822966868b2b9dd348615881b&download_timestamp=1632581672",
        " แฮร์รี่ พอตเตอร์กับเครื่องรางยมทูต",
        " J.K. Rowling",
        "ขอต้อนรับเพื่อนแฮร์รี่ พอตเตอร์ เข้าสู่โลกแห่งเวทมนตร์อีกครั้ง กับภาคตอนจบของบทสรุปแห่งภารกิจอันยิ่งใหญ่ของ 'แฮร์รี่' ขอเชิญทุกท่านร่วมเดินทางครั้งสุดท้ายไปกับเขากันเลย ในเล่มสุดท้ายนี้แฮร์รี่จะได้ค้นพบคำตอบของคำถามหลายๆ อย่างที่เขาสงสัยมาตลอดชีวิต รวมไปถึงคำตอบที่สำคัญที่สุด ทั้งต่อตัวแฮร์รี่เองและต่อโลกเวทมนตร์ นั่นคือ ระหว่างแฮร์รี่กับลอร์ดโวลเดอมอร์ ใครจะไม่อาจอยู่ได้ และใครจะอยู่รอด??? ทุกคนคงอยากรู้เต็มทีว่าเรื่องทั้งหมดจะคลี่คลายลงอย่างไร ไปติดตามกันได้ในเล่มเลย",
        696,
        3.2,
        "505"),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Color(0xFF0D47A1),
        title: Center(child: Text('แนะนำสำหรับคุณ')),
      ),
      body: Column(
        children: [
          SingleChildScrollView(
            child: Padding(
              padding: EdgeInsets.symmetric(vertical: 16, horizontal: 10.5),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                mainAxisAlignment: MainAxisAlignment.start,
                children: [
                  Container(
                    width: double.infinity,
                    height: 750,
                    child: ListView(
                      scrollDirection: Axis.vertical,
                      children: [
                        Row(
                          children: [
                            myBook(books[0]),
                            myBook(books[1]),
                            myBook(books[2]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[3]),
                            myBook(books[4]),
                            myBook(books[5]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[6]),
                            myBook(books[7]),
                            myBook(books[10]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[9]),
                            myBook(books[8]),
                            myBook(books[11]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[12]),
                            myBook(books[13]),
                          ],
                        ),
                      ],
                    ),
                  ),
                ],
              ),
            ),
          ),
        ],
      ),
    );
  }
}
