import 'package:book_store/Data/Bookdata.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import 'Mybook.dart';

class Cartoon extends StatefulWidget {
  static String name = 'Cartoon';
  const Cartoon({Key? key}) : super(key: key);

  @override
  _RecommendedState createState() => _RecommendedState();
}

class _RecommendedState extends State<Cartoon> {
  List<BookData> books = [
    BookData(
        "https://fv9-2.failiem.lv/thumb_show.php?i=3s28kggcv&download_checksum=9f0856a561ac962c746e78895b7bbde9b6e18768&download_timestamp=1632557587",
        " ตอน ยุทธการหนีความจน",
        "Irumo",
        "อยากรู้ไหมว่าจะประหยัดเงินค่าขนมได้อย่างไร ทำอย่างไรจึงจะทำให้เงินที่เก็บไว้มีเพิ่มมากขึ้น จะใช้ของฟรีได้ที่ไหนบ้าง ของที่เหลือใช้แล้วจะเอาไปทำอย่างอื่นได้ไหม ทำไมต้องจดบันทึกรายรับรายจ่าย ลองมาใช้ชีวิตกับครอบครัวตึ๋งหนืดดูสิ แล้วจะรู้คำตอบที่น่าทึ่งเรื่องวุ่นวายแสนอลหม่านของครอบครัวตึ๋งหนืดเริ่มต้นขึ้นเมื่อโกโร่หัวหน้าครอบครัวถูกลดเงินเดือน จนสมาชิกทุกคนต้องย้ายไปอยู่ในอพาร์ตเมนต์รูหนู แต่ครอบครัวตึ๋งหนืดซะอย่าง ไม่มีวันยอมแพ้ต่อโชคชะตาอันแสนรันทด ทุกคนจึงร่วมใจกันทำทุกวิถีทางเพื่อจะได้ย้ายไปอยู่ในบ้านสองห้องนอน จนทำให้เกิด ยุทธการหนีความจน ที่เด็กๆ เห็นแล้วจะต้องทึ่งกับความประหยัดแบบสุดๆ",
        224,
        4.5,
        "99"),
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=6k88vefwt&download_checksum=cf75e113e610653cbe99d1d3deaa7774866b5400&download_timestamp=1632557560",
        " ตอน กู้วิกฤต",
        "Huh Yoon-Jung",
        "ครอบครัวตึ๋งหนืดกำลังประสบวิกฤตอีกครั้ง เมื่อคุณพ่อถูกไล่ออกจากบริษัทแล้วโทรุกับฮารุก็ต้องโดนงดค่าขนม! เด็กๆ ต้องช่วยกันทำงานพิเศษเพื่อช่วยกู้วิกฤตในครั้งนี้ ซึ่งงานแต่ละอย่างนั้นล้วนไม่ธรรมดา เช่น เป็นแขกในงานแต่งงาน เก็บขยะในหมู่บ้าน รับจ้างร้องเพลงคาราโอเกะ อ่านหนังสือนิทานให้เด็กฟัง ชิมและประเมินรสชาติขนม ฯลฯ ",
        192,
        3.5,
        "129"),
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=8qagm7ej7&download_checksum=a53e6fa520a7fecfe41ea8390d7a7b70139f7979&download_timestamp=1632557140",
        "เอาชีวิตรอดด้วยเงิน30บาท",
        " Lee Bong Gi",
        "ครอบครัวตึ๋งหนืดกลับมาครั้งนี้จะมาสอนเคล็ดลับให้เราใช้เงินอย่างคุ้มค่า ใครว่าเงิน 30 บาทไม่มีค่าล่ะ! แชมป์ครอบครัวตึ๋งหนืดอย่างพวกเขาสามารถใช้มันทำอะไรได้ตั้งหลายอย่าง เช่น ใช้เงิน 30 บาทจัดงานขึ้นบ้านใหม่และงานวันเกิดพร้อมกัน ใช้เงิน 30 บาทไปเที่ยววันหยุด ใช้เงิน 30 บาทไปเดต ใช้เงิน 30 บาทกินข้าวเย็น มาเรียนรู้กลยุทธ์การประหยัดจากเงิน 30 บาทไปกับครอบครัวตึ๋งหนืดกันเถอะ",
        185,
        3.2,
        "159"),
    BookData(
        "https://fv9-1.failiem.lv/thumb_show.php?i=zd34kdh3x&download_checksum=59d5644b875f33022995bc033554357b2edf2c80&download_timestamp=1632558294",
        " ตอน ยาจกตระกูลตึ๋ง",
        " Storybox",
        "ครอบครัวตึ๋งหนืดที่สุดแสนจะประหยัดมีปัญหาใหญ่ที่แก้ไม่ตกเสียที นั่นคือโทรุที่เป็นตัวเขมือบประจำบ้าน แม้จะเป็นฝาแฝดกับฮารุ แต่ระดับความประหยัดกลับต่างกันราวฟ้ากับเหว ถ้าปล่อยให้เป็นแบบนี้ต่อไป ครอบครัวตึ๋งหนืดต้องกลายเป็นยาจกแน่ๆ แต่โรส ตึ๋งหนืดตัวแม่ไม่มีทางยอมแพ้ งานนี้เธอต้องเปลี่ยนนิสัยโทรุให้ได้ ว่าแล้วครอบครัวตึ๋งหนืดก็ต้องงัดเคล็ดลับการประหยัดออกมา เพื่อเปลี่ยนจอมเขมือบที่เก็บเงินไม่อยู่ให้กลายเป็นเศรษฐี เช่น วิธีใช้เวลาให้คุ้มค่าแบบเศรษฐีเวลา เทคนิคการคุ้ยตู้เย็นแบบตึ๋งหนืด การบริหารดวงตาช่วยให้สายตาดี เคล็ดลับแก้ปัญหาเด็กเลือกกินอาหาร การจัดการอาหารหมดอายุแบบไม่เสียของ แต่ละไอเดีย รับประกันความตืดความฮาแน่นอน ครอบครัวตึ๋งหนืด ตอน ยาจกตระกูลตึ๋ง จะพาทุกคนไปพบเคล็ดลับการประหยัดง่ายๆ ที่ทำได้เองและแบ่งปันแก่ผู้อื่นได้ ลองทำดูสิ แล้วเด็กๆ เองก็จะกลายเป้นเศรษฐีตึ๋งหนืดที่พ่อแม่ภูมิใจได้เช่นกัน",
        163,
        3.7,
        "159"),
    BookData(
        "https://fv2-1.failiem.lv/thumb_show.php?i=djrnj95ux&download_checksum=11ba2a814ae88b88bb394bb2c2f8d4a5ed1327f8&download_timestamp=1632562644",
        " ตอน กระชากหน้ากากตึ๋งหนืด",
        "Yim Chang-ho",
        "หน้ากากไหนๆ ที่ว่าแน่ ก็ต้องหลีกทางให้หน้ากากตึ๋งหนืด การประหยัดคือการลงมือปฏิบัติ ถ้าตั้งใจประหยัด ทุกสิ่งก็เป็นไปได้ นี่คือสโลแกนของหน้ากากตึ๋งหนืด ฮีโร่แห่งการประหยัดตัวจริง แม้ไม่มีใครรู้ว่าตัวจริงของเขาคือใคร แต่หน้ากากตึ๋งหนืดพร้อมจะช่วยเหลือทุกคนที่มีปัญหา",
        192,
        4.5,
        "189"),
    BookData(
        "https://fv2-2.failiem.lv/thumb_show.php?i=5jzcykf6x&download_checksum=d7f6772ad5ac303635c3fefa5683d405bb0e6766&download_timestamp=1632562782",
        " ตอน ทริปสุุดมัน ปั่นยกล้อ",
        "Yang, Tae-Soo",
        "กริ๊ง กริ๊ง ขอทางหน่อย แก๊งจักรยานตึ๋งหนืดสุดซิ่งมาแล้ว! ถ้ามีใครมาชวนเที่ยวทั่วประเทศโดยไม่ใช้เงินสักบาท อย่าเพิ่งคิดว่าจะเป็นไปไม่ได้ คว้าจักรยานแล้วปั่นตามครอบครัวตึ๋งหนืดมาเลย ครอบครัวตึ๋งหนืดวางแผนจะไปเที่ยวทั่วประเทศกัน แต่โรส ราชินีตึ๋งหนืด ไม่ยอมให้ใช้เงินอย่างสิ้นเปลืองแน่ๆ ทริปปั่นจักรยานโดยไม่ใช้เงินสักบาทจึงเริ่มต้นขึ้น แต่โทรุ จอมป่วนของเราจะไหวหรือเปล่านะ ในเมื่อจอมเขมือบแบบเขาไม่เคยรู้วิธีขี่จักรยานที่ถูกต้องเลย",
        192,
        3.5,
        "139"),
    BookData(
        "https://fv2-4.failiem.lv/thumb_show.php?i=gnkcsd7dq&download_checksum=13bff1738bc67725b5dfa05b10e108372482b1d1&download_timestamp=1632565684",
        " ตอน Coding เกมทะลุจอ",
        " Story box",
        "โทรุจอมเขมือบที่วันๆ คิดแต่เรื่องกิน ถูกเลือกเป็นตัวแทนแข่งขันโค้ดดิง หรือการเขียนโปรแกรมสำหรับเด็กร่วมกับฮารุและจอห์น ทั้งสามต้องฝ่าภารกิจสนุกๆ มากมายในสวนสนุกแห่งโลกอนาคตที่ทุกอย่างทำงานด้วยคอมพิวเตอร์ รวมไปถึงการสร้างเกมสุดมันที่โดนใจเด็กๆ",
        185,
        3.2,
        "199"),
    BookData(
        "https://fv2-4.failiem.lv/thumb_show.php?i=qdj5qev37&download_checksum=71dcb443c801148888e5b3a7b88ee45da97e9f7c&download_timestamp=1632565742",
        " ตอน โค้ชตึ๋งหนืดตืดระเบิด",
        " Yim Chang-ho",
        "โค้ชตึ๋งหนืด กูรูด้านการใช้เงินมาแล้ว! ใครมีปัญหาเรื่องการใช้เงินบ้าง ทั้งเก็บเงินไม่อยู่ ไม่รู้ว่าเงินตัวเองหายไปไหน พอได้เงินค่าขนมมาก็ซื้อของกินของเล่นจนหมด ไม่เหลือเงินออมเลยสักบาท ถ้าเป็นแบบนี้ในอนาคตต้องแย่แน่ๆ แต่อย่าเพิ่งกังวลไป เพราะโทรุและครอบครัวตึ๋งหนืดจะมาสวมบทเป็นโค้ชตึ๋งหนืดสอนเทคนิคการประหยัดง่ายๆ ให้เอง ตั้งแต่การเขียนบัญชีรายรับ-รายจ่าย ที่จะช่วยให้เก็บเงินได้แน่นอน การตรวจเช็กใบเสร็จรับเงินเพื่อค้นหาเงินที่หายไป รวมไปถึงเทคนิคประหยัดค่าใช้จ่ายในบ้านเพื่อช่วยคุณพ่อคุณแม่ เช่น ทำน้ำยาล้างจานใช้เอง เทคนิคประหยัดค่าไฟ การดูแลสุขภาพในฤดูหนาว เคล็ดลับช่วยให้นอนหลับสบาย และอีกมากมาย ครอบครัวตึ๋งหนืด ตอน โค้ชตึ๋งหนืดตืดระเบิด จะพาทุกคนไปพบเคล็ดลับการประหยัดต่างๆ ที่ทำได้เอง และแบ่งปันแก่ผู้อื่นได้ ลองทำดูสิ แล้วเด็กๆ เองก็จะเป็นโค้ชตึ๋งหนืดได้เช่นกัน",
        163,
        3.7,
        "159"),
    BookData(
        "https://fv9-3.failiem.lv/thumb_show.php?i=8ba49jd88&download_checksum=e2df36cc2fa28338953692b97b7d61f5e46094bd&download_timestamp=1632574065",
        " ALICE อลิซ",
        "Christina Henry",
        "เชื่อกันว่าโรงพยาบาลจิตเวชแห่งนี ้มีอสุรกายหลับใหลอยู่ในห้องใต้ดิน ตั้งแต่มาอยู่ที่นี่ อลิซ ก็ต้องเผชิญฝันร้ายทุกคืนงานเลี้ยงที่จบลงด้วยเลือด กระต่ายผู้ลึกลับที่จับจ้องเธอในเงามืด เรื่องเลวร้ายในอดีตทำให้เธอสูญเสียความทรงจำ กระต่าย ที่ปรากฏในฝันคือผู้กุมความลับทั้งหมดอลิซต้องออกตามหากระต่ายไปถึงดินแดนพิศวง ซึ่งมีทั้งผู้วิเศษและปีศาจจำแลงในร่างมนุษย์แต่การเดินทางของเธอกลับปลุกอสุรกายให้ตื่นขึ้นเมื่อคมเขี้ยวของมันขยับเข้าใกล้ อลิซคงอยากภาวนาให้ทุกอย่างเป็นเพียงฝันร้าย",
        400,
        4.8,
        "327"),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Color(0xFF0D47A1),
        title: Center(child: Text('หนังสือการ์ตูน')),
      ),
      body: Column(
        children: [
          SingleChildScrollView(
            child: Padding(
              padding: EdgeInsets.symmetric(vertical: 16, horizontal: 10.5),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                mainAxisAlignment: MainAxisAlignment.start,
                children: [
                  Container(
                    width: double.infinity,
                    height: 750,
                    child: ListView(
                      scrollDirection: Axis.vertical,
                      children: [
                        Row(
                          children: [
                            myBook(books[0]),
                            myBook(books[1]),
                            myBook(books[2]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[3]),
                            myBook(books[4]),
                            myBook(books[5]),
                          ],
                        ),
                        SizedBox(height: 10),
                        Row(
                          children: [
                            myBook(books[6]),
                            myBook(books[7]),
                          ],
                        ),
                        SizedBox(height: 10),
                      ],
                    ),
                  ),
                ],
              ),
            ),
          ),
        ],
      ),
    );
  }
}
